[
  {
    "Job Title": "Data Scientist",
    "Company": "IndiGo (InterGlobe Aviation Ltd)",
    "Location": "Gurugram, Haryana, India",
    "HR Details": null,
    "HR Email": null,
    "Date Posted": "2025-07-03T09:55:35.000Z",
    "Number of Applicants": null,
    "Top Skills Required": [
      "Data analysis",
      "Anomaly detection",
      "Machine learning",
      "Big data analytics",
      "Programming skills",
      "Deep learning Techniques"
    ],
    "Experience": "A minimum of 6 years of hands-on experience working directly with data, particularly in the context of data science and machine learning.",
    "Summary of the job": "We are looking for a motivated and highly skilled Data Scientist to join our Flight Safety team. This role will be pivotal in using advanced data analytics and machine learning techniques to enhance flight safety decisions and processes. The candidate will work with time-series, multi-variate data to detect anomalies, identify patterns, and build predictive models that support safety management. The ideal candidate should have a strong foundation in data science, machine learning, and deep learning techniques, along with expertise in applying these skills in the aviation safety domain.",
    "title_from_rss": "IndiGo (InterGlobe Aviation Ltd) hiring Data Scientist in Gurugram, Haryana, India",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-indigo-interglobe-aviation-ltd-4257690082",
    "cover_letter": "Dear Hiring Manager,\n\nI am writing to express my interest in the Data Scientist position at IndiGo (InterGlobe Aviation Ltd) in Gurugram. With a strong academic background in Electrical Engineering from the National Institute of Technology, Raipur, coupled with over five years of hands-on experience in advanced analytics, predictive modeling, and machine learning, I am confident in my ability to contribute effectively to your data science team.\n\nCurrently, as an Assistant Vice President at Citi in Mumbai, I have successfully leveraged cutting-edge AI techniques including Generative AI frameworks like Semantic Search and LangChain, as well as machine learning models such as XGBoost and K-Means clustering to drive revenue growth and optimize client engagement strategies. My work with large-scale behavioral data, applying techniques like NLP for client feedback analysis and robust revenue prediction, demonstrates my capability to handle complex data challenges and extract actionable business insights.\n\nPrior to this, at ZS in Pune, I specialized in customer-centric marketing strategies, developing predictive models using CNNs and Genetic Algorithms that increased revenue by 10-15%. I have also designed sophisticated marketing mix models and hybrid recommender systems that significantly enhanced campaign ROI and customer targeting—skills that align well with data-driven decision making and market segmentation needs.\n\nMy proficiency in Python, R, SQL, PySpark, and deep learning frameworks like Pytorch and Keras, combined with a strong foundation in statistical analysis and data visualization, enables me to deliver end-to-end solutions from data extraction to model deployment. Moreover, my soft skills in problem-solving, adaptability, and analytical thinking equip me to thrive in dynamic, fast-paced environments such as IndiGo’s.\n\nI am excited about the opportunity to apply my expertise in machine learning and analytics to support IndiGo’s mission of operational excellence and customer satisfaction. I am confident that my technical skills, industry experience, and passion for data science make me an excellent fit for your team.\n\nThank you for considering my application. I look forward to the possibility of discussing how I can contribute to the continued success and innovation at IndiGo.\n\nSincerely,  \nShubham Agrawal  \nshubhamagrawal790@gmail.com  \n+91 9039797263"
  },
  {
    "Job Title": "Python Developer",
    "Company": "Infosys",
    "Location": "Bengaluru, Karnataka, India",
    "HR Details": null,
    "HR Email": null,
    "Date Posted": "2025-07-03T05:06:55.000Z",
    "Number of Applicants": null,
    "Top Skills Required": [
      "Python"
    ],
    "Experience": null,
    "Summary of the job": "About the Company\nInfosys is a global leader in technology services and consulting, dedicated to helping clients navigate their digital transformation journey.\n\nAbout the Role\nA day in the life of an Infoscion involves ensuring effective Design, Development, Validation, and Support activities to assure that our clients are satisfied with the high levels of service in the technology domain.\n\nResponsibilities\n- You will gather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements.\n- You will play a key role in the overall estimation of work requirements to provide the right information on project estimations to Technology Leads and Project Managers.\n- You would be a key contributor to building efficient programs/systems.\n- If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!\n\nQualifications\nMCA, MSc, MTech, Bachelor of Engineering, BCA, BSc, BTech\n\nRequired Skills\nPrimary skills: Technology -> OpenSystem -> Python - OpenSystem\n\nPreferred Skills\nTechnology -> OpenSystem -> Python - OpenSystem -> Python",
    "title_from_rss": "Infosys hiring Python Developer in Bengaluru, Karnataka, India",
    "link": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4242299754",
    "cover_letter": "Dear Hiring Manager,\n\nI am writing to express my interest in the Python Developer position at Infosys in Bengaluru. With a strong background in data analytics, machine learning, and software development, coupled with extensive experience in Python programming, I am confident in my ability to contribute effectively to your team and drive impactful solutions.\n\nCurrently, I serve as an Assistant Vice President at Citi, where I leverage Python extensively for building advanced analytics frameworks. My work involves designing and implementing machine learning models—including regression, clustering, and NLP techniques—to optimize client segmentation, enhance revenue prediction, and extract actionable insights from large-scale behavioral data. I have hands-on experience utilizing libraries such as PyTorch and Keras for deep learning projects and integrating cutting-edge generative AI tools like LangChain to enhance data-driven decision making.\n\nPrior to this, I was a Decision Analytics Associate Consultant at ZS, where I developed and deployed predictive models and recommender systems that improved customer engagement and marketing ROI by 10-15%. My role required strong proficiency in Python and SQL for data manipulation and model deployment, along with expertise in working in agile, cross-functional environments.\n\nMy educational foundation in Electrical Engineering from the National Institute of Technology, Raipur, has been a strong enabler for my analytical and technical capabilities. Combined with my adaptability, problem-solving mindset, and commitment to continuous learning, I am well-prepared to take on the challenges and opportunities at Infosys.\n\nI am eager to bring my expertise in Python development, machine learning, and data analytics to Infosys and contribute to your innovative projects and organizational growth. Thank you for considering my application. I look forward to the possibility of discussing how my skills and experiences align with your team’s needs.\n\nSincerely,  \nShubham Agrawal"
  },
  {
    "Job Title": "ML Scientist II",
    "Company": "Wayfair",
    "Location": "Bengaluru, Karnataka, India",
    "HR Details": null,
    "HR Email": null,
    "Date Posted": "2025-07-03T04:18:37.000Z",
    "Number of Applicants": null,
    "Top Skills Required": [
      "Python",
      "Machine learning model deployment",
      "Statistical models such as regression, clustering",
      "Machine learning algorithms such as decision trees, neural networks",
      "Written and verbal communication skills",
      "Continuous learning / intellectual curiosity",
      "Python machine learning ecosystem (numpy, pandas, sklearn, XGBoost)",
      "Apache Spark ecosystem (Spark SQL, MLlib/Spark ML)",
      "GCP or AWS or Azure",
      "Machine learning orchestration tools (Airflow, Kubeflow, MLFlow)",
      "Information retrieval",
      "Query/intent understanding",
      "Search ranking",
      "Recommender systems",
      "Deep learning frameworks (PyTorch, Tensorflow)"
    ],
    "Experience": "3+ years of industry experience with a Bachelor/ Master’s degree or minimum of 1-2 years of industry experience with PhD in Computer Science, Mathematics, Statistics, or related field.",
    "Summary of the job": "Wayfair’s Advertising business is rapidly expanding with an Ads Platform that leverages state of the art Machine Learning. The Advertising Optimization & Automation Science team focuses on using machine learning and generative AI to streamline campaign workflows and deliver impactful budget, tROAS and SKU recommendations. The role involves developing large-scale machine learning models, collaborating with commercial and engineering teams, and solving impactful problems to directly impact Wayfair’s revenue.",
    "title_from_rss": "Wayfair hiring ML Scientist II in Bengaluru, Karnataka, India",
    "link": "https://in.linkedin.com/jobs/view/ml-scientist-ii-at-wayfair-4223786745",
    "cover_letter": "Dear Hiring Manager,\n\nI am writing to express my interest in the ML Scientist II position at Wayfair in Bengaluru. With a strong background in machine learning, data analytics, and predictive modeling—as well as relevant hands-on experience leveraging advanced AI techniques to drive revenue growth—I am excited about the opportunity to contribute to Wayfair’s innovative data science initiatives.\n\nCurrently, I serve as an AVP in Client Strategy and Analytics at Citi, Mumbai, where I have successfully designed and deployed sophisticated machine learning models and natural language processing frameworks to extract actionable insights from large-scale behavioral data. My work with Generative AI methods, including semantic search and LangChain, along with the application of clustering (K-Means), regression (XGBoost), and NLP tools such as KeyBERT, directly contributed to optimized client segmentation and significantly improved revenue targeting strategies. Additionally, I led cross-sell analyses in episodic derivatives, achieving a 3x revenue uplift by identifying strategic opportunities within M&A financing contexts.\n\nPrior to this, I worked as a Decision Analytics Associate Consultant at ZS, where I developed and implemented deep learning models, including convolutional neural networks and genetic algorithms, to enhance customer engagement prediction and optimize marketing spend through marketing mix modeling. This experience honed my ability to combine multiple data sources and modeling approaches—skills that align well with the multidisciplinary challenges at Wayfair.\n\nI hold a B.Tech. in Electrical Engineering from the National Institute of Technology, Raipur, which provided me with a strong technical and analytical foundation. My proficient programming skills in Python, R, SQL, and PySpark, combined with expertise in machine learning frameworks like PyTorch and Keras, enable me to deliver robust, scalable solutions. Beyond technical expertise, I bring strong problem-solving abilities, adaptability, and a data-driven mindset essential for thriving in dynamic environments and delivering impactful insights.\n\nI am particularly drawn to this role at Wayfair due to its emphasis on innovative machine learning applications and data-driven decision-making to enhance customer experiences and operational efficiency. I am confident that my blend of analytical rigor, practical experience, and passion for AI-driven impact would make a meaningful contribution to your team.\n\nThank you for considering my application. I look forward to the opportunity to further discuss how my background and skills align with Wayfair’s goals.\n\nSincerely,  \nShubham Agrawal  \nshubhamagrawal790@gmail.com  \n+91 9039797263"
  },
  {
    "Job Title": "Data Science",
    "Company": "Tata Electronics",
    "Location": "Dholera, Gujarat, India",
    "HR Details": null,
    "HR Email": null,
    "Date Posted": "2025-07-02T12:19:12.000Z",
    "Number of Applicants": null,
    "Top Skills Required": [
      "Machine learning models",
      "Computer vision",
      "Python code writing",
      "Linux OS",
      "Data pipelines",
      "CNN, RNN, DNN mathematics",
      "Model deployment",
      "Teamwork",
      "Communication",
      "AI/ML technologies"
    ],
    "Experience": "2yrs - 5yrs",
    "Summary of the job": "Tata Electronics Private Limited (TEPL) is a greenfield venture of the Tata Group with expertise in manufacturing precision components. Tata Electronics is building India’s first AI-enabled state-of-the-art Semiconductor Foundry producing chips for power management IC, display drivers, microcontrollers, high-performance computing logic etc., targeting markets like automotive, computing, data storage, wireless communications and AI. Responsibilities include developing advanced machine learning models, computer vision algorithms, working closely with domain experts and data engineers, analyzing large datasets, collaborating with the mother company's AI team, optimizing models, monitoring performance, ensuring data quality and communicating technical results to non-technical stakeholders. Essential attributes include willingness to work in semiconductor domain, proficiency in computer vision and Python, debugging skills, Linux knowledge, experience with large datasets and pipelines, deep mathematical understanding of neural networks, deployment experience, teamwork and communication skills, and enthusiasm for learning new AI/ML technologies. Qualifications required are BE/ME in Computer Science, Machine Learning, Electronics Engineering, Applied Mathematics or Statistics.",
    "title_from_rss": "Tata Electronics hiring Data Science in Dholera, Gujarat, India",
    "link": "https://in.linkedin.com/jobs/view/data-science-at-tata-electronics-4245487493",
    "cover_letter": "Dear Hiring Manager,\n\nI am writing to express my interest in the Data Science position at Tata Electronics in Dholera, Gujarat. With a strong academic background in Electrical Engineering from the National Institute of Technology, Raipur, and extensive hands-on experience in data science, analytics, and machine learning, I am confident in my ability to contribute effectively to your team and drive data-driven business outcomes.\n\nCurrently, I serve as an Assistant Vice President in Client Strategy and Analytics at Citi, Mumbai, where I leverage advanced techniques such as generative AI, semantic search, and machine learning algorithms to deliver actionable insights that optimize client engagement and revenue generation. My experience in building scalable client segmentation models using K-Means clustering and XGBoost regression, as well as utilizing NLP tools like KeyBERT to extract meaningful feedback, aligns well with Tata Electronics’ need for sophisticated data analysis and actionable intelligence.\n\nPrior to this, my role as a Decision Analytics Associate Consultant at ZS, Pune, involved leading the design and deployment of predictive models—ranging from convolutional neural networks to genetic algorithms—that directly enhanced customer targeting and marketing ROI by up to 15%. This experience has honed my ability to blend statistical analysis, machine learning, and business acumen to deliver measurable impact, skills that I am eager to apply to your data science initiatives.\n\nMy technical proficiency includes Python, R, SQL, PySpark, and deep learning frameworks such as PyTorch and Keras. Coupled with my experience in data visualization, predictive modeling, and market segmentation, I bring a comprehensive skill set that supports data integration, process optimization, and strategic decision-making.\n\nBeyond technical capabilities, I am known for my adaptability, analytical mindset, and problem-solving approach—all vital qualities in dynamic, innovative environments like Tata Electronics. I am excited by the prospect of contributing to your team’s success by harnessing data science to unlock new efficiencies and business opportunities.\n\nThank you for considering my application. I look forward to the opportunity to discuss how my background and skills can support the continued growth and innovation at Tata Electronics.\n\nSincerely,  \nShubham Agrawal  \nshubhamagrawal790@gmail.com  \n+91 9039797263"
  },
  {
    "Job Title": "AI/ML Engineer",
    "Company": "Weekday AI (YC W21)",
    "Location": "Bengaluru, Karnataka, India",
    "HR Details": null,
    "HR Email": null,
    "Date Posted": "2025-07-02T09:20:51.000Z",
    "Number of Applicants": null,
    "Top Skills Required": [
      "Machine Learning",
      "Deep Learning",
      "NLP",
      "Generative AI tools and frameworks (Hugging Face Transformers, OpenAI APIs, LangChain, LlamaIndex)",
      "Python",
      "PyTorch",
      "TensorFlow",
      "scikit-learn",
      "JAX",
      "Agentic AI concepts and frameworks (Auto-GPT, BabyAGI, CrewAI, LangGraph)",
      "Prompt engineering",
      "Software engineering best practices",
      "Version control (Git)",
      "CI/CD",
      "Containerization (Docker)",
      "Cloud platforms (AWS, GCP, Azure)"
    ],
    "Experience": "4-12 years",
    "Summary of the job": "This role is for one of the Weekday's clients. We are seeking a passionate and highly skilled AI/ML Engineer to join our growing AI team. The candidate will work at the intersection of cutting-edge artificial intelligence and real-world product development, driving innovations in Agentic AI systems and Generative AI models. Responsibilities include designing, developing, and deploying AI-driven solutions leveraging Agentic AI frameworks and architectures; building and fine-tuning Generative AI models for content generation, summarization, personalization, and automation; engineering intelligent multi-agent systems for autonomous reasoning, decision-making, and tool use; collaborating cross-functionally to integrate ML models into scalable production systems; owning the end-to-end ML lifecycle including data ingestion, feature engineering, model training, evaluation, deployment, and monitoring; continuously improving model performance using experimentation, A/B testing, and feedback loops; staying updated with latest AI research; and contributing to architectural decisions and mentoring junior developers. Preferred qualifications include experience with RAG or tool-using agents, knowledge graphs, semantic search, vector databases, reinforcement learning or planning algorithms, and contributions to open-source AI/ML projects.",
    "title_from_rss": "Weekday AI (YC W21) hiring AI/ML Engineer in Bengaluru, Karnataka, India",
    "link": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-weekday-ai-yc-w21-4260825099",
    "cover_letter": "Dear Hiring Team at Weekday AI,\n\nI am writing to express my interest in the AI/ML Engineer position at Weekday AI. With a strong foundation in machine learning, advanced analytics, and practical experience applying AI techniques to solve complex business problems, I am confident in my ability to contribute effectively to your team.\n\nI hold a B.Tech. in Electrical Engineering from the National Institute of Technology, Raipur, and over five years of hands-on experience working with leading organizations in analytics and AI-driven decision making. Currently, as an AVP in Client Strategy and Analytics at Citi, Mumbai, I have leveraged cutting-edge generative AI methods such as the Retrieval-Augmented Generation (RAG) framework combined with Semantic Search and LangChain technologies to accurately estimate fintech wallet potential. My work with ML techniques like linear regression, K-Means clustering, XGBoost, and NLP models such as KeyBERT, has directly led to revenue optimization and enhanced client engagement strategies.\n\nPrior to this, I served as a Decision Analytics Associate Consultant at ZS, where I developed and deployed predictive models including convolutional neural networks (CNNs) and genetic algorithms that improved customer-centric marketing strategies and drove significant revenue uplift. My experience in building hybrid recommender systems and optimizing marketing budgets using Marketing Mix Modeling further equips me with the ability to deliver actionable AI-driven insights.\n\nI am highly proficient in Python, R, SQL, PySpark, Pytorch, and Keras, and possess a deep understanding of data analysis, machine learning algorithms, deep learning, and natural language processing. Beyond my technical skills, I bring adaptability, analytical problem-solving, and a results-driven mindset, all essential qualities for thriving in a dynamic startup environment like Weekday AI.\n\nI am excited about the opportunity to contribute to Weekday AI’s mission and work alongside a talented team to build innovative AI solutions. Thank you for considering my application. I look forward to the possibility of discussing how my skills and experience align with your needs.\n\nWarm regards,  \nShubham Agrawal  \nshubhamagrawal790@gmail.com  \n+91 9039797263"
  }
]